trade_exp/src/DataProcessors/ЗагрузкаИзВнешнегоФайла_Альтерра/ЗагрузкаИзВнешнегоФайла_Альтерра.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаИзВнешнегоФайла_Альтерра</name>
  <tabularSections>
    <name>Настройки</name>
    <attributes>
      <name>Настройка</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>CatalogRef</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодТипа</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/Enums/ТипыНоменклатуры/ТипыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>МногооборотнаяТара</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Товар</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Работа</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Услуга</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Набор</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыНалогообложенияНДС</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="4023d8d4-9e71-4a9b-b0b9-205c28e22f29">
    <name>ЭкспортСырьевыхТоваровУслуг</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="540bf057-2915-4a0d-8b55-1833fc259d70">
    <name>ЭкспортНесырьевыхТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ОприходованиеИзлишковТоваров/ОприходованиеИзлишковТоваров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ОприходованиеИзлишковТоваров</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПересчетТоваров</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>АналитикаДоходов</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="f7a6aa00-7209-4006-94f6-c9dff24f6c36">
    <name>ИсключитьИзКонтроля</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="b702872a-ff55-42de-874e-18cc7a282867">
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="2eb46e7c-716d-4be4-aa38-2fc009550c44">
    <name>ИсточникИнформацииОЦенахДляПечати</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Количество</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Назначение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВидЗапасов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НомерГТД</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="ca95b564-2edc-42ea-b560-434d30f026a6">
      <name>КоличествоПоРНПТ</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>23</precision>
            <scale>11</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c60c8224-938d-4349-ba8a-1a8e21ddde83">
      <name>СтатусУказанияСерий</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/DataProcessors/ЗагрузкаИзВнешнегоФайла_Альтерра/Forms/Форма/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.КэшированныеЗначения) Тогда
		КэшированныеЗначения = Параметры.КэшированныеЗначения;
	КонецЕсли;
	
	если Параметры.Свойство("ОтчетКомиссионера") тогда
		    Макет = Обработки.ЗагрузкаИзВнешнегоФайла_Альтерра.ПолучитьМакет("МакетОтчетКомиссионера");
		иначе
			ЗаполнитьНастройки();
			Макет = Обработки.ЗагрузкаИзВнешнегоФайла_Альтерра.ПолучитьМакет("Макет");
			
		конецесли;
	Область=Макет.ПолучитьОбласть("Таблица");
	ТабличныйДокумент.Присоединить(Область);
	ТабличныйДокумент.ФиксацияСверху = 1;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНастройки()
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Начало (Строка)";
	СтрокаНастройки.КодТипа = 1; //Строка;
	СтрокаНастройки.Значение="R2";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Конец (Строка)";
	СтрокаНастройки.КодТипа = 1; //Строка;
	СтрокаНастройки.Значение="R100";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Код (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C1";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Номенклатура (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C2";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Количество (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C3";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Цена (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C4";
	
	СтрокаНастройки = Объект.Настройки.Добавить();
	СтрокаНастройки.Настройка = "Сумма (Колонка)";
	СтрокаНастройки.КодТипа = 2; //Колонка;
	СтрокаНастройки.Значение="C5";
КонецПроцедуры

&НаКлиенте
Процедура ПроверитьИРассчитать(Команда)
	УдалитьЗаполнениеЦветомВерхнейТаблицы("");
	ОчиститьСообщения();
	Состояние(НСтр("ru = 'Осуществляется сопоставление введенных данных с данными информационной базы. Пожалуйста подождите...'"),,,БиблиотекаКартинок.Информация32);
	Объект.Товары.Очистить();
	ЕстьОбшибкиРаспознования = СопоставитьДанныеТДСНоменклатуройНаСервере();
	Если ЕстьОбшибкиРаспознования Тогда
		Сообщить("Есть ошибки распознования, ознакомьтесь с информационными сообщениями.");
	КонецЕсли;
	Если Объект.Товары.Количество() > 0 Тогда
		Элементы.ФормаПеренестиИЗакрыть.Видимость = Истина;
		Элементы.ФормаПеренестиИЗакрыть.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УдалитьЗаполнениеЦветомВерхнейТаблицы(Команда)
	ТабличныйДокумент.Область(ПолучитьИмяОбластиИзНастроек()).ЦветФона = Новый Цвет();
КонецПроцедуры

&НаСервере
Функция СопоставитьДанныеТДСНоменклатуройНаСервере()
	ЦветИспользованныхДанных = Новый Цвет(100,255,0);
	ЦветНеассоциированныхДанных = Новый Цвет(255,200,200);
	ЕстьОшибкиРаспознавания = Ложь;
	Для Каждого СтрокаНастройки Из Объект.Настройки Цикл
		Если СтрокаНастройки.Настройка = "Код (Колонка)" Тогда
			КолонкаКод = СтрокаНастройки.Значение;
		КонецЕсли;
		Если СтрокаНастройки.Настройка = "Номенклатура (Колонка)" Тогда
			КолонкаНоменклатура = СтрокаНастройки.Значение; 
		КонецЕсли;
		Если СтрокаНастройки.Настройка = "Количество (Колонка)" Тогда
			КолонкаКоличество = СтрокаНастройки.Значение;
		КонецЕсли;
		Если СтрокаНастройки.Настройка = "Цена (Колонка)" Тогда
			КолонкаЦена = СтрокаНастройки.Значение;
		КонецЕсли;
		Если СтрокаНастройки.Настройка = "Сумма (Колонка)" Тогда
			КолонкаСумма = СтрокаНастройки.Значение;
		КонецЕсли;
	КонецЦикла;
	НомерПервойСтроки = 2;
	НомерПоследнейСтроки = 1000;
	НомерСтроки = НомерПервойСтроки - 1;
	Пока НомерСтроки + 1 <= НомерПоследнейСтроки Цикл
		НомерСтроки = НомерСтроки + 1;
		ИмяСтроки = "R" + Формат(НомерСтроки, "ЧН=0; ЧГ=0");
		Код = ВернутьЗначениеЯчейкиПоУсловияю(ТабличныйДокумент, ИмяСтроки, КолонкаКод);
		Номенклатура = ВернутьСсылкуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, КолонкаНоменклатура, "Номенклатура", "Номенклатура");
		Количество = ВернутьЧислоИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, КолонкаКоличество, "Количество");
		Цена = ВернутьЧислоИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, КолонкаЦена, "Цена");
		Сумма = ВернутьЧислоИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, КолонкаСумма, "Сумма");
		РаскраситьЯчейки = Ложь;
		Если ЗначениеЗаполнено(Код) Или ЗначениеЗаполнено(Номенклатура) Тогда
			Если Количество <> 0 Тогда
				Если ЗначениеЗаполнено(Код) Тогда
					СсылкаНаЭлемент = Справочники.Номенклатура.НайтиПоКоду(Код);
					Если СсылкаНаЭлемент.Пустая() И ЗначениеЗаполнено(Номенклатура) Тогда
						СсылкаНаЭлемент = Номенклатура;
					КонецЕсли;
				ИначеЕсли ЗначениеЗаполнено(Номенклатура) Тогда
					СсылкаНаЭлемент = Номенклатура;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(СсылкаНаЭлемент) Тогда
					Сообщить("Некорректно заполнены данные номенклатуры в строке " + Строка(НомерСтроки));
				ИначеЕсли Цена = 0 И Сумма = 0 Тогда
					Сообщить("В строке " + Строка(НомерСтроки) + " не заполнена ни цена, ни сумма.");
				Иначе
					Если Цена = 0 Тогда
						Цена = Сумма / Количество;
					ИначеЕсли Сумма = 0 Тогда
						Сумма = Цена * Количество;
					КонецЕсли;
					РаскраситьЯчейки = Истина;
				КонецЕсли;
			Иначе
				Сообщить("Нулевое количество в строке " + Строка(НомерСтроки));
			КонецЕсли;
		Иначе
			Если Количество = 0 И Цена = 0 И Сумма = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЕсли;
		Если РаскраситьЯчейки Тогда //сопоставление удалось...
			Строка = Объект.Товары.Добавить();
			Строка.Номенклатура = СсылкаНаЭлемент;
			Строка.Количество = Количество;
			Строка.Цена = Цена;
			Строка.Сумма = Сумма;
			РаскраситьЯчейкуПоУсловию(ТабличныйДокумент, ЦветИспользованныхДанных, ИмяСтроки);
		Иначе
			РаскраситьЯчейкуПоУсловию(ТабличныйДокумент, ЦветНеассоциированныхДанных, ИмяСтроки);
			ЕстьОшибкиРаспознавания = Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат ЕстьОшибкиРаспознавания;	
КонецФункции

&НаСервере
Функция ВернутьЗначениеЯчейкиПоУсловияю(ТД, ИмяСтроки, ИмяКолонки)
	Если ЗначениеЗаполнено(ИмяКолонки) Тогда
		Возврат СокрЛП(ТД.Область(ИмяСтроки + ИмяКолонки).Текст);
	КонецЕсли;
	Возврат "";
КонецФункции

&НаСервере
Функция ВернутьСсылкуИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, Колонка, ИмяКолонки, ИмяСправочника)
	Строка = ВернутьЗначениеЯчейкиПоУсловияю(ТабличныйДокумент, ИмяСтроки, Колонка);
	Если Строка <> "" Тогда
		Ссылка = Справочники[ИмяСправочника].НайтиПоНаименованию(Строка, Истина);
		Если ЗначениеЗаполнено(Ссылка) Тогда
			Возврат Ссылка;
		Иначе
			Возврат Справочники[ИмяСправочника].ПустаяСсылка();
		КонецЕсли;
	Иначе
		Возврат Справочники[ИмяСправочника].ПустаяСсылка();
	КонецЕсли;
КонецФункции

&НаСервере
Функция ВернутьЧислоИзЗначенияЯчейки(ТабличныйДокумент, ИмяСтроки, Колонка, ИмяКолонки)
	Строка = ВернутьЗначениеЯчейкиПоУсловияю(ТабличныйДокумент, ИмяСтроки, Колонка);
	Если Строка <> "" Тогда
		Попытка
			Возврат Число(Строка);
		Исключение
			Сообщить("В строке " + Прав(ИмяСтроки, СтрДлина(ИмяСтроки) - 1) + " некорректно заполнено поле """ + ИмяКолонки + """. Значение изменено на 0.");
			Возврат 0;
		КонецПопытки;
	Иначе
		Возврат 0;
	КонецЕсли;
КонецФункции

&НаСервере
Процедура РаскраситьЯчейкуПоУсловию(ТД, Цвет, ИмяСтроки)
	ТД.Область(ИмяСтроки + "C1:" + ИмяСтроки + "C5").ЦветФона = Цвет;
КонецПроцедуры

&НаКлиенте
Функция ПолучитьИмяОбластиИзНастроек()
	МинСтр = -1;
	МаксСтр = -1; 
	МинКол = -1; 
	МаксКол = -1;
	Для Каждого СтрокаНастроек Из Объект.Настройки Цикл
		Если Не ЗначениеЗаполнено(СтрокаНастроек.Значение) Тогда Продолжить; КонецЕсли;
		Если СтрокаНастроек.КодТипа = 1 Тогда //Строка
			Стр = Число(Сред(СтрокаНастроек.Значение, 2));
			МинСтр = ?(МинСтр = -1, Стр, Мин(МинСтр, Стр));
			МаксСтр = ?(МаксСтр = -1, Стр, Макс(МаксСтр, Стр));
		ИначеЕсли СтрокаНастроек.КодТипа = 2 Тогда //Колонка
			Кол = Число(Сред(СтрокаНастроек.Значение, 2));
			МинКол = ?(МинКол = -1, Кол, Мин(МинКол, Кол));
			МаксКол = ?(МаксКол = -1, Кол, Макс(МаксКол, Кол));
		КонецЕсли;			
	КонецЦикла;
	Если МинСтр = -1 Или МаксСтр = -1 Или МинКол = -1 Или МаксКол = -1 Тогда
		Возврат "C1:C20";
	Иначе
		Возврат "R" + МинСтр + "C" + МинКол + ":" + "R" + МаксСтр + "C" + МаксКол;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура ПеренестиИЗакрыть(Команда)        
	
	Если ВладелецФормы.ИмяФормы	= "Документ.ОприходованиеИзлишковТоваров.Форма.ФормаДокумента" Тогда
		ФормаОприходования = Истина;
	Иначе
		ФормаОприходования = Ложь;
	КонецЕсли;	
	
	
	Для Каждого Строка Из Объект.Товары Цикл
		НайденныеСтроки = ВладелецФормы.Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));
		Если НайденныеСтроки.Количество() > 0 Тогда
			Для Каждого Элемент Из НайденныеСтроки Цикл
				Если Не Элемент.Отменено Тогда
					Если Элемент.КоличествоУпаковок <> Строка.Количество Тогда
						Элемент.КоличествоУпаковок = Строка.Количество;
						ВладелецФормы.Модифицированность = Истина;
						ПриИзмененииКоличества(Элемент);
					КонецЕсли;
					Если Элемент.Цена <> Строка.Цена Тогда
						Элемент.Цена = Строка.Цена;
						ВладелецФормы.Модифицированность = Истина;
						ПриИзмененииЦены(Элемент);	
					КонецЕсли;
					Если Элемент.Сумма <> Строка.Сумма Тогда
						Элемент.Сумма = Строка.Сумма;
						ВладелецФормы.Модифицированность = Истина;
						ПриИзмененииСуммы(Элемент);
					КонецЕсли;
					Прервать;
				КонецЕсли;
			КонецЦикла;
		Иначе
			//Добавляем
			ВладелецФормы.Модифицированность = Истина;
			НоваяСтрока = ВладелецФормы.Объект.Товары.Добавить();
			если  не ФормаОприходования тогда
				НоваяСтрока.Номенклатура = Строка.Номенклатура;
				// Обработка добавления Номенклатуры
				НоваяСтрока.Подразделение = ВладелецФормы.Объект.Подразделение;
				НоваяСтрока.Склад= ВладелецФормы.Объект.Склад;
				СтруктураПересчетаСуммы = Новый Структура;
				СтруктураПересчетаСуммы.Вставить("ЦенаВключаетНДС", ВладелецФормы.Объект.ЦенаВключаетНДС);
				
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", ВладелецФормы.Объект.ВернутьМногооборотнуюТару);
				СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары",ВладелецФормы. Объект.ВернутьМногооборотнуюТару);
				СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", ВладелецФормы.Объект.ВернутьМногооборотнуюТару);
				СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДС", Новый Структура("НалогообложениеНДС, Дата, Организация", ВладелецФормы.Объект.НалогообложениеНДС, ВладелецФормы.Объект.Дата, ВладелецФормы.Объект.Организация));
				СтруктураДействий.Вставить("ЗаполнитьСтавкуНДСВозвратнойТары", ВладелецФормы.Объект.ВернутьМногооборотнуюТару);
				СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
				СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
				СтруктураДействий.Вставить("ЗаполнитьНоменклатуруПоставщикаПоНоменклатуре", ВладелецФормы.Объект.Партнер);
				
				Если НоваяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Товар") Тогда
					НоваяСтрока.СписатьНаРасходы = Ложь;
					НоваяСтрока.СтатьяРасходов = ПредопределенноеЗначение("ПланВидовХарактеристик.СтатьиРасходов.ПустаяСсылка");
					НоваяСтрока.АналитикаРасходов = Неопределено;
					НоваяСтрока.Подразделение = ПредопределенноеЗначение("Справочник.СтруктураПредприятия.ПустаяСсылка");
				ИначеЕсли НоваяСтрока.ТипНоменклатуры = ПредопределенноеЗначение("Перечисление.ТипыНоменклатуры.Услуга") Тогда
					НоваяСтрока.СписатьНаРасходы = Истина;
				КонецЕсли;
				НоваяСтрока.КоличествоУпаковок = Строка.Количество;
				НоваяСтрока.Цена = Строка.Цена;
				НоваяСтрока.Сумма = Строка.Сумма;
				Если ВладелецФормы.Объект.ПоступлениеОднойДатой Тогда
					НоваяСтрока.ДатаПоступления = ВладелецФормы.Объект.ДатаПоступления;
				КонецЕсли;
				ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(НоваяСтрока, СтруктураДействий, Неопределено);
			иначе
				НоваяСтрока.Номенклатура = Строка.Номенклатура;
				НоваяСтрока.Количество = Строка.Количество;
				НоваяСтрока.Цена = Строка.Цена;
				НоваяСтрока.Сумма = Строка.Сумма;

			конецесли;
		КонецЕсли;
	КонецЦикла;
	
	если  не ФормаОприходования тогда
		//Отменяем если нету таких строк
		Для Каждого Строка Из ВладелецФормы.Объект.Товары Цикл
			НайденныеСтроки = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", Строка.Номенклатура));
			Если НайденныеСтроки.Количество() = 0 Тогда
				ВладелецФормы.Модифицированность = Истина;
				Строка.Отменено = Истина;
				Строка.ПричинаОтмены = НайтиПричинуОтмены();
				СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ВладелецФормы);
				СтруктураДействий = Новый Структура;
				СтруктураДействий.Вставить("ЗаполнитьПризнакБезВозвратнойТары", ВладелецФормы.Объект.ВернутьМногооборотнуюТару);
				СтруктураДействий.Вставить("ЗаполнитьПризнакОтмененоБезВозвратнойТары", ВладелецФормы.Объект.ВернутьМногооборотнуюТару);
				СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
				ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(Строка, СтруктураДействий, КэшированныеЗначения);
				ОбновитьЗависимыеРеквизиты(ВладелецФормы);
			КонецЕсли;
		КонецЦикла;

		РассчитатьИтоговыеПоказателиЗаказа(ВладелецФормы);
	конецесли;  
	
	Закрыть();
КонецПроцедуры

&НаСервереБезКонтекста
Функция НайтиПричинуОтмены()
	Возврат Справочники.ПричиныОтменыЗаказовПоставщикам.НайтиПоНаименованию("снята потребность", Истина);
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, Форма)
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Форма);
	СтруктураДействий.Вставить("ПересчитатьКоличествоЕдиниц");
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(Форма)
	СтруктураПересчетаСуммы = ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВСтрокеТЧ(Форма.Объект);
	Возврат СтруктураПересчетаСуммы;
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЗависимыеРеквизиты()
	Возврат Новый Структура(
	"БезВозвратнойТары,ОтмененоБезВозвратнойТары,Отменено",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки",
	"Сумма,СуммаНДС,СуммаСНДС,СуммаРучнойСкидки");
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Процедура РассчитатьИтоговыеПоказателиЗаказа(Форма)
	если Форма.имяформы="Документ.ЗаказПоставщику.Форма.ФормаДокумента" тогда
		// Заполнение итогов по таблице "Товары"
		КоллекцияТовары = Форма.Объект.Товары;
		Форма.СуммаОтменено     = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДСОтменено"),
		КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
		Форма.СуммаЗаказаноСзалоговойТарой = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"),
		КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
		Форма.СуммаЗаказано = КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары");
		Форма.СуммаЗалогаЗаТару = ?(Форма.Объект.ТребуетсяЗалогЗаТару,(КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"))
		- (КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары")),0);
		Форма.СуммаНДСЗаказано = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаНДС") - КоллекцияТовары.Итог("СуммаНДСОтменено"),
		КоллекцияТовары.Итог("СуммаНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаНДСОтмененоБезВозвратнойТары"));
		Форма.СуммаРучнойСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаРучнойСкидки") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтменено"),
		КоллекцияТовары.Итог("СуммаРучнойСкидкиБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтмененоБезВозвратнойТары"));
		
		Если КоллекцияТовары.Итог("СуммаСНДСОтменено") = КоллекцияТовары.Итог("СуммаСНДС") Тогда
			Форма.ВсеСтрокиОтменены = Истина;
		Иначе
			Форма.ВсеСтрокиОтменены = Ложь;
		КонецЕсли;
		
		СуммаЗаказано = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("Сумма") - КоллекцияТовары.Итог("СуммаОтменено"),
		КоллекцияТовары.Итог("СуммаБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаОтмененоБезВозвратнойТары"));
		
		// Заполнение итогов по таблице этапы оплаты
		Форма.СуммаАвансаДоПодтверждения     = 0;
		Форма.СуммаПредоплатыДоПоступления   = 0;
		Форма.СуммаКредитаПослеПоступления   = 0;
		
		СоответствиеВариантовОплаты = Новый Соответствие;
		СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.АвансДоПодтверждения"),
		Новый Структура("Сумма", "СуммаАвансаДоПодтверждения"));
		СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.ПредоплатаДоПоступления"),
		Новый Структура("Сумма", "СуммаПредоплатыДоПоступления"));
		СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыКонтроляОплатыПоставщику.КредитПослеПоступления"),
		Новый Структура("Сумма", "СуммаКредитаПослеПоступления"));
		
		Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
			ИменаЭлементов = СоответствиеВариантовОплаты[ТекСтрока.ВариантОплаты];
			Если ИменаЭлементов <> Неопределено Тогда
				Форма[ИменаЭлементов.Сумма] = Форма[ИменаЭлементов.Сумма] + ТекСтрока.СуммаПлатежа
				+ ?(Форма.Объект.ТребуетсяЗалогЗаТару, ТекСтрока.СуммаЗалогаЗаТару, 0);
			КонецЕсли;
		КонецЦикла;
		
		// Выбор страницы отображения НДС
		Если Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС")
			ИЛИ Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.НалоговыйАгентПоНДС") Тогда
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
		Иначе
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
		КонецЕсли;
	иначе
		
		// Заполнение итогов по таблице "Товары"
		КоллекцияТовары = Форма.Объект.Товары;
		
		Форма.СуммаЗаказаноСЗалоговойТарой = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"),
		КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
		Форма.СуммаЗаказано     = КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары");
		Форма.СуммаЗалогаЗаТару = ?(Форма.Объект.ТребуетсяЗалогЗаТару,(КоллекцияТовары.Итог("СуммаСНДС") - КоллекцияТовары.Итог("СуммаСНДСОтменено"))
		- (КоллекцияТовары.Итог("СуммаСНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары")),0);
		Форма.СуммаНДСЗаказано  = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаНДС") - КоллекцияТовары.Итог("СуммаНДСОтменено"),
		КоллекцияТовары.Итог("СуммаНДСБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаНДСОтмененоБезВозвратнойТары"));
		Форма.СуммаАвтоСкидки   = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидки") - КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиОтменено"),
		КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаАвтоматическойСкидкиОтмененоБезВозвратнойТары"));
		Форма.СуммаРучнойСкидки = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаРучнойСкидки") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтменено"),
		КоллекцияТовары.Итог("СуммаРучнойСкидкиБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаРучнойСкидкиОтмененоБезВозвратнойТары"));
		Форма.СуммаСкидки       = Форма.СуммаАвтоСкидки + Форма.СуммаРучнойСкидки;
		Форма.СуммаОтменено     = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("СуммаСНДСОтменено"),
		КоллекцияТовары.Итог("СуммаСНДСОтмененоБезВозвратнойТары"));
		
		Если КоллекцияТовары.Итог("СуммаСНДСОтменено") = КоллекцияТовары.Итог("СуммаСНДС") Тогда
			Форма.ВсеСтрокиОтменены = Истина;
		Иначе
			Форма.ВсеСтрокиОтменены = Ложь;
		КонецЕсли;
		
		СуммаЗаказано = ?(Форма.Объект.ТребуетсяЗалогЗаТару,
		КоллекцияТовары.Итог("Сумма") - КоллекцияТовары.Итог("СуммаОтменено"),
		КоллекцияТовары.Итог("СуммаБезВозвратнойТары") - КоллекцияТовары.Итог("СуммаОтмененоБезВозвратнойТары"));
		
		Если СуммаЗаказано > 0 
			И (СуммаЗаказано + Форма.СуммаСкидки) <> 0 Тогда
			Форма.ПроцентАвтоСкидки   = Форма.СуммаАвтоСкидки * 100 / (СуммаЗаказано + Форма.СуммаСкидки);
			Форма.ПроцентРучнойСкидки = Форма.СуммаРучнойСкидки * 100 / (СуммаЗаказано + Форма.СуммаСкидки);
			Форма.ПроцентСкидки       = Форма.ПроцентАвтоСкидки + Форма.ПроцентРучнойСкидки;
		ИначеЕсли Форма.СуммаСкидки > 0 Тогда
			Форма.ПроцентАвтоСкидки   = Форма.СуммаАвтоСкидки * 100 / Форма.СуммаСкидки;
			Форма.ПроцентРучнойСкидки = Форма.СуммаРучнойСкидки * 100 / Форма.СуммаСкидки;
			Форма.ПроцентСкидки       = 100;
		Иначе
			Форма.ПроцентАвтоСкидки   = 0;
			Форма.ПроцентРучнойСкидки = 0;
			Форма.ПроцентСкидки       = 0;
		КонецЕсли;
		
		// Заполнение итогов по этапам оплаты
		Форма.СуммаАвансаДоОбеспечения = 0;
		Форма.СуммаПредоплатыДоОтгрузки = 0;
		Форма.СуммаКредитаПослеОтгрузки = 0;
		Форма.ПроцентАвансаДоОбеспечения = 0;
		Форма.ПроцентПредоплатыДоОтгрузки = 0;
		Форма.ПроцентКредитаПослеОтгрузки = 0;
		
		СоответствиеВариантовОплаты = Новый Соответствие;
		СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.АвансДоОбеспечения"),
		Новый Структура("Сумма, Проценты", "СуммаАвансаДоОбеспечения", "ПроцентАвансаДоОбеспечения"));
		СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.ПредоплатаДоОтгрузки"),
		Новый Структура("Сумма, Проценты", "СуммаПредоплатыДоОтгрузки", "ПроцентПредоплатыДоОтгрузки"));
		СоответствиеВариантовОплаты.Вставить(ПредопределенноеЗначение("Перечисление.ВариантыОплатыКлиентом.КредитПослеОтгрузки"),
		Новый Структура("Сумма, Проценты", "СуммаКредитаПослеОтгрузки", "ПроцентКредитаПослеОтгрузки"));
		
		Для Каждого ТекСтрока Из Форма.Объект.ЭтапыГрафикаОплаты Цикл
			ИменаЭлементов = СоответствиеВариантовОплаты[ТекСтрока.ВариантОплаты];
			Если ИменаЭлементов <> Неопределено Тогда
				Форма[ИменаЭлементов.Сумма] = Форма[ИменаЭлементов.Сумма] + ТекСтрока.СуммаПлатежа
				+ ?(Форма.Объект.ТребуетсяЗалогЗаТару, ТекСтрока.СуммаЗалогаЗаТару, 0);
			КонецЕсли;
		КонецЦикла;
		
		СуммаВсегоПоЭтапам = Форма.СуммаАвансаДоОбеспечения + Форма.СуммаПредоплатыДоОтгрузки + Форма.СуммаКредитаПослеОтгрузки;
		Если СуммаВсегоПоЭтапам <> 0 Тогда
			Форма.ПроцентАвансаДоОбеспечения  = (Форма.СуммаАвансаДоОбеспечения/СуммаВсегоПоЭтапам)*100;
			Форма.ПроцентПредоплатыДоОтгрузки = (Форма.СуммаПредоплатыДоОтгрузки/СуммаВсегоПоЭтапам)*100;;
			Форма.ПроцентКредитаПослеОтгрузки = (Форма.СуммаКредитаПослеОтгрузки/СуммаВсегоПоЭтапам)*100;
		КонецЕсли;
		
		// Выбор странцицы отображения НДС
		Если Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаНеОблагаетсяНДС")
			ИЛИ Форма.Объект.НалогообложениеНДС = ПредопределенноеЗначение("Перечисление.ТипыНалогообложенияНДС.ПродажаОблагаетсяЕНВД") Тогда
			
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоБезНДС;
			Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаБезНДС;
		Иначе
			
			Форма.Элементы.ГруппаСтраницыВсего.ТекущаяСтраница = Форма.Элементы.СтраницаВсегоСНДС;
			Форма.Элементы.ГруппаСтраницыНДС.ТекущаяСтраница   = Форма.Элементы.СтраницаСНДС;
		КонецЕсли;
		
	конецесли;
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииКоличества(ТекущаяСтрока)
	СтруктураДействий = Новый Структура;	
	ДобавитьВСтруктуруДействияПриИзмененииКоличестваУпаковок(СтруктураДействий, ВладелецФормы);
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	РассчитатьИтоговыеПоказателиЗаказа(ВладелецФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииЦены(ТекущаяСтрока)
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ВладелецФормы);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	СтруктураДействий.Вставить("ПересчитатьСуммуСУчетомРучнойСкидки", Новый Структура("Очищать", Ложь));
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	РассчитатьИтоговыеПоказателиЗаказа(ВладелецФормы);
КонецПроцедуры

&НаКлиенте
Процедура ПриИзмененииСуммы(ТекущаяСтрока)
	СтруктураПересчетаСуммы = ПолучитьСтруктуруПересчетаСуммыНДСВСтрокеТЧ(ВладелецФормы);
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьЦенуСкидкуПоСуммеВЗакупках", ПакетнаяОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруПересчетаЦеныСкидкиВЗакупкахВТЧ(ВладелецФормы.Объект, ВладелецФормы.Объект.ХозяйственнаяОперация = ПредопределенноеЗначение("Перечисление.ХозяйственныеОперации.ПриемНаКомиссию")));
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ЗаполнитьДубликатыЗависимыхРеквизитов", ЗависимыеРеквизиты());
	ПакетнаяОбработкаТабличнойЧастиКлиент.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	РассчитатьИтоговыеПоказателиЗаказа(ВладелецФормы);
КонецПроцедуры

&НаКлиенте
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ИдентификаторСтроки, СтруктураДействий, Форма)
	
	Строка = Форма.Объект.Товары.НайтиПоИдентификатору(ИдентификаторСтроки);
	ТекущаяСтрока = Новый Структура("АналитикаРасходов, АналитикаРасходовЗаказРеализация, АналитикаРасходовОбязательна, Артикул, БезВозвратнойТары, ДатаПоступления, ИсходныйНомерСтроки, КодСтроки, Количество, КоличествоУпаковок, Назначение, Номенклатура, НоменклатураПоставщика, НомерСтроки, Отменено, ОтмененоБезВозвратнойТары, Подразделение, ПричинаОтмены, ПроцентРучнойСкидки, Склад, СписатьНаРасходы, СтавкаНДС, СтатьяРасходов, Сумма, СуммаБезВозвратнойТары, СуммаНДС, СуммаНДСБезВозвратнойТары, СуммаНДСОтменено, СуммаНДСОтмененоБезВозвратнойТары, СуммаОтменено, СуммаОтмененоБезВозвратнойТары, СуммаРучнойСкидки, СуммаРучнойСкидкиБезВозвратнойТары, СуммаРучнойСкидкиОтменено, СуммаРучнойСкидкиОтмененоБезВозвратнойТары, СуммаСНДС, СуммаСНДСБезВозвратнойТары, СуммаСНДСОтменено, СуммаСНДСОтмененоБезВозвратнойТары, ТипНоменклатуры, Упаковка, УсловиеЦеныПоставщика, Характеристика, ХарактеристикиИспользуются, Цена");
	ЗаполнитьЗначенияСвойств(ТекущаяСтрока, Строка);
	ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
	ЗаполнитьЗначенияСвойств(Строка, ТекущаяСтрока);
	ОбновитьЗависимыеРеквизиты(Форма);
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения)
	ПакетнаяОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимыеРеквизиты(Форма)
	
	Если Не Форма.СкладГруппа И ЗначениеЗаполнено(Форма.Объект.Склад) Тогда
		
		Форма.Элементы.КартинкаНесколькоСкладов.Картинка = Новый Картинка();
		Форма.НадписьНесколькоСкладов = "";
		
	Иначе
		
		СтруктураИтогов = Новый Структура("РазличныеСклады");
		ОбеспечениеКлиентСервер.СброситьИтогиОбходаТаблицы(СтруктураИтогов);
		СтруктураИтогов.РазличныеСклады.ТекстСкладовОтгрузкиПереопределяемый = НСтр("ru = 'Складов поступления'");
		РассчитатьИтогиОбходаТаблицы(Форма.Объект.Товары, СтруктураИтогов);
		ОбеспечениеКлиентСервер.ОбновитьЗависимыеРеквизитыФормы(Форма, СтруктураИтогов);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиОбходаТаблицы(ТЧТовары, СтруктураИтогов)
	ОбеспечениеСервер.РассчитатьИтогиОбходаТаблицы(ТЧТовары, СтруктураИтогов);
КонецПроцедуры
